src/filter_data.org
#+TITLE: Filtering the Data from the Aggregated Player Data
#+STARTUP: headlines
#+STARTUP: nohideblocks
#+STARTUP: noindent
#+OPTIONS: toc:4 h:4 ^:nil _:nil
#+PROPERTY: header-args:emacs-lisp :comments link
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+EXPORT_FILE_NAME: filter_data.html
#+HTML_HEAD: <style> #content{max-width:1800px;}</style>

* Activating Python Environment

  This code block must be run to activate python virtual environment for
  org session "SESSION_1". The following Python code blocks are run in
  "SESSION_1" in which the virtual environment should have been activated.

#+BEGIN_SRC emacs-lisp :session SESSION_1 :exports both
  (pyvenv-activate "~/gitRepos/TTK28-project/venv/")
#+END_SRC

#+RESULTS:

* Importing dependencies
  This filtering of data typically uses ~pandas~ and ~numpy~ for data storage
  and manipulation. Additionally a the Random function is used for picking out
  the data. The data is standardized using ~Sklearn~ and the ~StandardScalar~.

#+begin_src python :session SESSION_1 :results output :exports both
import pandas as pd
import numpy as np
from numpy.random import RandomState
from icecream import ic
from sklearn.preprocessing import StandardScaler, OneHotEncoder
#+end_src

#+RESULTS:

* Hyperparameters
  In order to more easily configure the model and keep track of the setting,
  this hyperparameters dictionary is defined here and used throughout the code
  where needed.

#+begin_src python :session SESSION_1 :results output :exports both
NAME = "full"
DATA_BALANCE_PERCENTAGE = 0.8
TRAINING_DATA_FRACTION = 0.8
#+end_src

#+RESULTS:

* Helper Function

   This function determines the number of samples to extract based on a
   percentage how imbalanced the dataset should be.

#+begin_src python :session SESSION_1 :results output :exports both
def num_sample(percentage, hof_df):
    hof_length = len(hof_df['G_all'])
    return int((percentage * hof_length)/(1 - percentage))
#+end_src

#+RESULTS:

* Importing and Cleaning the Data

#+begin_src python :session SESSION_1 :results output :exports both
df = pd.read_csv('../data/final_data.csv')
#+end_src

#+RESULTS:
: sys:1: DtypeWarning: Columns (48) have mixed types.Specify dtype option on import or set low_memory=False.

  Fixing Last Game Played date into a ~float32~.

#+begin_src python :session SESSION_1 :results output :exports both
# Splits the final Game date and convert to string
finalGameYear = df['finalGame'].str.split(pat="-", expand=True)[0]
df['finalGame'] = finalGameYear
# Removing NaN fields from the dataset
df = df[finalGameYear.notnull()]
# Adding back to dataset as ints
df['finalGame'] = df['finalGame'].astype('float32')
#+end_src

#+RESULTS:

  Fixing parts that cannot have NaN.

#+begin_src python :session SESSION_1 :results output :exports both
  # Replacing NaN in each column with 0 and adding back as type
  award_names = ['Most Valuable Player', 'World Series MVP', 'AS_games', 'Gold Glove',
                 'Rookie of the Year', 'Silver Slugger','G', 'AB', 'R', 'H', '2B', '3B',
                 'HR', 'RBI', 'SB', 'BB', 'SO', 'IBB', 'HBP', 'SH', 'SF', 'BB-A', 'H-A',
                 'IPouts', 'SO-A', 'BB-A', 'IBB-A', 'PO', 'A', 'E', 'DP', 'ERA']
  for col in award_names:
      df[col] = df[col].fillna(0)
      df[col] = df[col].astype('float32')
#+end_src

#+RESULTS:

