src/filter_data.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-15 Sun 22:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Filtering the Data from the Aggregated Player Data</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Olav Landmark Pedersen" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Filtering the Data from the Aggregated Player Data</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc69c339">1. Activating Python Environment</a></li>
<li><a href="#org048f0af">2. Importing dependencies</a></li>
<li><a href="#orge7d98ed">3. Hyperparameters</a></li>
<li><a href="#orge4c527a">4. Helper Function</a></li>
<li><a href="#org5d4484f">5. Importing and Cleaning the Data</a></li>
<li><a href="#orgd304acb">6. Creating Additional Statistics</a></li>
<li><a href="#org6feaf58">7. Fulfilling criteria for HoF eligibility</a></li>
<li><a href="#org5827419">8. Preparing to Feed Data into Model</a>
<ul>
<li><a href="#org22b3807">8.1. Selecting Variables to use in training</a></li>
<li><a href="#org7237659">8.2. One Hot Encoding for Player Position Data</a></li>
<li><a href="#orgb7a7589">8.3. Standardizing the Data</a></li>
<li><a href="#org609d56e">8.4. Converting HoF back to strings</a></li>
<li><a href="#org4514ba5">8.5. Splitting dataset by HoF players</a></li>
<li><a href="#orgd71f4b9">8.6. Under-sampling the non-HoF players</a></li>
<li><a href="#orgd7b3308">8.7. Splitting reg and HoF into train and test</a></li>
<li><a href="#org7e18cbc">8.8. Merging the test and training datasets</a></li>
</ul>
</li>
<li><a href="#orgf51f0bf">9. Save the different testing and validation data sets</a></li>
<li><a href="#orgfcff4ff">10. Links to Other Files in Project</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc69c339" class="outline-2">
<h2 id="orgc69c339"><span class="section-number-2">1</span> Activating Python Environment</h2>
<div class="outline-text-2" id="text-1">
<p>
This code block must be run to activate python virtual environment for
org session "SESSION_1". The following Python code blocks are run in
"SESSION_1" in which the virtual environment should have been activated.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5e7e9b;">(</span>pyvenv-activate <span style="color: #5a7273;">"~/gitRepos/TTK28-project/venv/"</span><span style="color: #5e7e9b;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org048f0af" class="outline-2">
<h2 id="org048f0af"><span class="section-number-2">2</span> Importing dependencies</h2>
<div class="outline-text-2" id="text-2">
<p>
This filtering of data typically uses <code>pandas</code> and <code>numpy</code> for data storage
and manipulation. Additionally a the Random function is used for picking out
the data. The data is standardized using <code>Sklearn</code> and the <code>StandardScalar</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #5e7e9b; font-weight: bold;">import</span> pandas <span style="color: #5e7e9b; font-weight: bold;">as</span> pd
<span style="color: #5e7e9b; font-weight: bold;">import</span> numpy <span style="color: #5e7e9b; font-weight: bold;">as</span> np
<span style="color: #5e7e9b; font-weight: bold;">from</span> numpy.random <span style="color: #5e7e9b; font-weight: bold;">import</span> RandomState
<span style="color: #5e7e9b; font-weight: bold;">from</span> icecream <span style="color: #5e7e9b; font-weight: bold;">import</span> ic
<span style="color: #5e7e9b; font-weight: bold;">from</span> sklearn.preprocessing <span style="color: #5e7e9b; font-weight: bold;">import</span> StandardScaler, OneHotEncoder
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7d98ed" class="outline-2">
<h2 id="orge7d98ed"><span class="section-number-2">3</span> Hyperparameters</h2>
<div class="outline-text-2" id="text-3">
<p>
In order to more easily configure the model and keep track of the setting,
this hyperparameters dictionary is defined here and used throughout the code
where needed.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #7e97af;">NAME</span> = <span style="color: #5a7273;">"full"</span>
<span style="color: #7e97af;">DATA_BALANCE_PERCENTAGE</span> = <span style="color: #cb8986;">0</span>.<span style="color: #cb8986;">8</span>
<span style="color: #7e97af;">TRAINING_DATA_FRACTION</span> = <span style="color: #cb8986;">0</span>.<span style="color: #cb8986;">8</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge4c527a" class="outline-2">
<h2 id="orge4c527a"><span class="section-number-2">4</span> Helper Function</h2>
<div class="outline-text-2" id="text-4">
<p>
This function determines the number of samples to extract based on a
percentage how imbalanced the dataset should be.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #5e7e9b; font-weight: bold;">def</span> <span style="color: #bf6c68; font-weight: bold;">num_sample</span><span style="color: #5e7e9b;">(</span>percentage, hof_df<span style="color: #5e7e9b;">)</span>:
    <span style="color: #7e97af;">hof_length</span> = <span style="color: #5e7e9b;">len</span><span style="color: #5e7e9b;">(</span>hof_df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'G_all'</span><span style="color: #bf6c68;">]</span><span style="color: #5e7e9b;">)</span>
    <span style="color: #5e7e9b; font-weight: bold;">return</span> <span style="color: #5e7e9b;">int</span><span style="color: #5e7e9b;">(</span><span style="color: #bf6c68;">(</span>percentage * hof_length<span style="color: #bf6c68;">)</span>/<span style="color: #bf6c68;">(</span><span style="color: #cb8986;">1</span> - percentage<span style="color: #bf6c68;">)</span><span style="color: #5e7e9b;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5d4484f" class="outline-2">
<h2 id="org5d4484f"><span class="section-number-2">5</span> Importing and Cleaning the Data</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7e97af;">df</span> = pd.read_csv<span style="color: #5e7e9b;">(</span><span style="color: #5a7273;">'../data/final_data.csv'</span><span style="color: #5e7e9b;">)</span>
</pre>
</div>

<pre class="example">
sys:1: DtypeWarning: Columns (48) have mixed types.Specify dtype option on import or set low_memory=False.
</pre>


<p>
Fixing Last Game Played date into a <code>float32</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #48485e;"># </span><span style="color: #48485e;">Splits the final Game date and convert to string</span>
<span style="color: #7e97af;">finalGameYear</span> = df<span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'finalGame'</span><span style="color: #5e7e9b;">]</span>.<span style="color: #5e7e9b;">str</span>.split<span style="color: #5e7e9b;">(</span>pat=<span style="color: #5a7273;">"-"</span>, expand=<span style="color: #cb8986;">True</span><span style="color: #5e7e9b;">)[</span><span style="color: #cb8986;">0</span><span style="color: #5e7e9b;">]</span>
<span style="color: #7e97af;">df</span><span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'finalGame'</span><span style="color: #5e7e9b;">]</span> = finalGameYear
<span style="color: #48485e;"># </span><span style="color: #48485e;">Removing NaN fields from the dataset</span>
<span style="color: #7e97af;">df</span> = df<span style="color: #5e7e9b;">[</span>finalGameYear.notnull<span style="color: #bf6c68;">()</span><span style="color: #5e7e9b;">]</span>
<span style="color: #48485e;"># </span><span style="color: #48485e;">Adding back to dataset as ints</span>
<span style="color: #7e97af;">df</span><span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'finalGame'</span><span style="color: #5e7e9b;">]</span> = df<span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'finalGame'</span><span style="color: #5e7e9b;">]</span>.astype<span style="color: #5e7e9b;">(</span><span style="color: #5a7273;">'float32'</span><span style="color: #5e7e9b;">)</span>
</pre>
</div>

<p>
Fixing parts that cannot have NaN.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #48485e;"># </span><span style="color: #48485e;">Replacing NaN in each column with 0 and adding back as type</span>
<span style="color: #7e97af;">award_names</span> = <span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'Most Valuable Player'</span>, <span style="color: #5a7273;">'World Series MVP'</span>, <span style="color: #5a7273;">'AS_games'</span>, <span style="color: #5a7273;">'Gold Glove'</span>,
               <span style="color: #5a7273;">'Rookie of the Year'</span>, <span style="color: #5a7273;">'Silver Slugger'</span>,<span style="color: #5a7273;">'G'</span>, <span style="color: #5a7273;">'AB'</span>, <span style="color: #5a7273;">'R'</span>, <span style="color: #5a7273;">'H'</span>, <span style="color: #5a7273;">'2B'</span>, <span style="color: #5a7273;">'3B'</span>,
               <span style="color: #5a7273;">'HR'</span>, <span style="color: #5a7273;">'RBI'</span>, <span style="color: #5a7273;">'SB'</span>, <span style="color: #5a7273;">'BB'</span>, <span style="color: #5a7273;">'SO'</span>, <span style="color: #5a7273;">'IBB'</span>, <span style="color: #5a7273;">'HBP'</span>, <span style="color: #5a7273;">'SH'</span>, <span style="color: #5a7273;">'SF'</span>, <span style="color: #5a7273;">'BB-A'</span>, <span style="color: #5a7273;">'H-A'</span>,
               <span style="color: #5a7273;">'IPouts'</span>, <span style="color: #5a7273;">'SO-A'</span>, <span style="color: #5a7273;">'BB-A'</span>, <span style="color: #5a7273;">'IBB-A'</span>, <span style="color: #5a7273;">'PO'</span>, <span style="color: #5a7273;">'A'</span>, <span style="color: #5a7273;">'E'</span>, <span style="color: #5a7273;">'DP'</span>, <span style="color: #5a7273;">'ERA'</span><span style="color: #5e7e9b;">]</span>
<span style="color: #5e7e9b; font-weight: bold;">for</span> col <span style="color: #5e7e9b; font-weight: bold;">in</span> award_names:
    <span style="color: #7e97af;">df</span><span style="color: #5e7e9b;">[</span>col<span style="color: #5e7e9b;">]</span> = df<span style="color: #5e7e9b;">[</span>col<span style="color: #5e7e9b;">]</span>.fillna<span style="color: #5e7e9b;">(</span><span style="color: #cb8986;">0</span><span style="color: #5e7e9b;">)</span>
    <span style="color: #7e97af;">df</span><span style="color: #5e7e9b;">[</span>col<span style="color: #5e7e9b;">]</span> = df<span style="color: #5e7e9b;">[</span>col<span style="color: #5e7e9b;">]</span>.astype<span style="color: #5e7e9b;">(</span><span style="color: #5a7273;">'float32'</span><span style="color: #5e7e9b;">)</span>
</pre>
</div>
</div>
</div>
