src/filter_data.org
* Creating Additional Statistics

  In order to aggregate the data into stats which are considered features/stats
  which express the skill of a batter. It would be possible to use all the
  features individually, but with a smaller and imbalanced dataset it would be
  nice not to have to include more features than necessary. These stats are 1B,
  SLG, OBS, OPS.

#+begin_src python :session SESSION_1 :results output :exports both
  # Adding the Batting Stats
  df['1B'] = df['H'] - df['2B'] - df['3B'] - df['HR']
  df['SLG'] = (df['1B'] + 2*df['2B'] + 3*df['3B'] + 4*df['HR'])/df['AB']
  df['OBS'] = (df['H'] + df['BB'] + df['HBP'])/(df['AB'] + df['BB']+ df['HBP']+ df['SF'])
  df['OPS'] = df['SLG'] + df['OBS']

  # Adding the Pitching Stats
  df['WHIP'] = round(3*(df['BB-A'] + df['H-A'])/df['IPouts'], 2)
  df['KperBB'] = round(df['SO-A']/(df['BB-A'] - df['IBB-A']), 2)

  new_stats = ['1B', 'SLG', 'OBS', 'OPS', 'WHIP', 'KperBB']
  for col in new_stats:
      df[col] = df[col].fillna(0)
      df[col] = df[col].astype('float32')
#+end_src

#+RESULTS:

* Fulfilling criteria for HoF eligibility

  Removing players who have played less than 10 years as these players are not
  eligible for the MLB Hall of Fame.

#+begin_src python :session SESSION_1 :results output :exports both
  df = df[df['Years_Played'] >= 10] # 10 years
#+end_src

#+RESULTS:

* Preparing to Feed Data into Model

** Selecting Variables to use in training

#+begin_src python :session SESSION_1 :results output :exports both
   hof_label_df = df[['playerID', 'HoF', 'POS']]
   df_inf_containing = df[['WHIP', 'KperBB']]
   df = df[['G_all', 'finalGame', 'OPS', 'SB', 'HR',
            'Years_Played', 'Most Valuable Player', 'AS_games',
            'Gold Glove', 'Rookie of the Year', 'World Series MVP', 'Silver Slugger',
            'WHIP', 'ERA', 'KperBB', 'PO', 'A', 'E', 'DP']]

   df_inf = np.isinf(df_inf_containing)
   # Removing index of values with infinity values from both data to be
   # standardized and the label data
   df = df[~df_inf['WHIP']]
   df = df[~df_inf['KperBB']]
   hof_label_df = hof_label_df[~df_inf['WHIP']]
   hof_label_df = hof_label_df[~df_inf['KperBB']]
#+end_src

#+RESULTS:
: /tmp/babel-aDvIBM/python-PmDC6f:12: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
:   df = df[~df_inf['KperBB']]
: /tmp/babel-aDvIBM/python-PmDC6f:14: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
:   hof_label_df = hof_label_df[~df_inf['KperBB']]

