src/filter_data.html

<div id="outline-container-orgd304acb" class="outline-2">
<h2 id="orgd304acb"><span class="section-number-2">6</span> Creating Additional Statistics</h2>
<div class="outline-text-2" id="text-6">
<p>
In order to aggregate the data into stats which are considered features/stats
which express the skill of a batter. It would be possible to use all the
features individually, but with a smaller and imbalanced dataset it would be
nice not to have to include more features than necessary. These stats are 1B,
SLG, OBS, OPS.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #48485e;"># </span><span style="color: #48485e;">Adding the Batting Stats</span>
<span style="color: #7e97af;">df</span><span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'1B'</span><span style="color: #5e7e9b;">]</span> = df<span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'H'</span><span style="color: #5e7e9b;">]</span> - df<span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'2B'</span><span style="color: #5e7e9b;">]</span> - df<span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'3B'</span><span style="color: #5e7e9b;">]</span> - df<span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'HR'</span><span style="color: #5e7e9b;">]</span>
<span style="color: #7e97af;">df</span><span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'SLG'</span><span style="color: #5e7e9b;">]</span> = <span style="color: #5e7e9b;">(</span>df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'1B'</span><span style="color: #bf6c68;">]</span> + <span style="color: #cb8986;">2</span>*df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'2B'</span><span style="color: #bf6c68;">]</span> + <span style="color: #cb8986;">3</span>*df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'3B'</span><span style="color: #bf6c68;">]</span> + <span style="color: #cb8986;">4</span>*df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'HR'</span><span style="color: #bf6c68;">]</span><span style="color: #5e7e9b;">)</span>/df<span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'AB'</span><span style="color: #5e7e9b;">]</span>
<span style="color: #7e97af;">df</span><span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'OBS'</span><span style="color: #5e7e9b;">]</span> = <span style="color: #5e7e9b;">(</span>df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'H'</span><span style="color: #bf6c68;">]</span> + df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'BB'</span><span style="color: #bf6c68;">]</span> + df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'HBP'</span><span style="color: #bf6c68;">]</span><span style="color: #5e7e9b;">)</span>/<span style="color: #5e7e9b;">(</span>df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'AB'</span><span style="color: #bf6c68;">]</span> + df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'BB'</span><span style="color: #bf6c68;">]</span>+ df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'HBP'</span><span style="color: #bf6c68;">]</span>+ df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'SF'</span><span style="color: #bf6c68;">]</span><span style="color: #5e7e9b;">)</span>
<span style="color: #7e97af;">df</span><span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'OPS'</span><span style="color: #5e7e9b;">]</span> = df<span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'SLG'</span><span style="color: #5e7e9b;">]</span> + df<span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'OBS'</span><span style="color: #5e7e9b;">]</span>

<span style="color: #48485e;"># </span><span style="color: #48485e;">Adding the Pitching Stats</span>
<span style="color: #7e97af;">df</span><span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'WHIP'</span><span style="color: #5e7e9b;">]</span> = <span style="color: #5e7e9b;">round</span><span style="color: #5e7e9b;">(</span><span style="color: #cb8986;">3</span>*<span style="color: #bf6c68;">(</span>df<span style="color: #5a7273;">[</span><span style="color: #5a7273;">'BB-A'</span><span style="color: #5a7273;">]</span> + df<span style="color: #5a7273;">[</span><span style="color: #5a7273;">'H-A'</span><span style="color: #5a7273;">]</span><span style="color: #bf6c68;">)</span>/df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'IPouts'</span><span style="color: #bf6c68;">]</span>, <span style="color: #cb8986;">2</span><span style="color: #5e7e9b;">)</span>
<span style="color: #7e97af;">df</span><span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'KperBB'</span><span style="color: #5e7e9b;">]</span> = <span style="color: #5e7e9b;">round</span><span style="color: #5e7e9b;">(</span>df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'SO-A'</span><span style="color: #bf6c68;">]</span>/<span style="color: #bf6c68;">(</span>df<span style="color: #5a7273;">[</span><span style="color: #5a7273;">'BB-A'</span><span style="color: #5a7273;">]</span> - df<span style="color: #5a7273;">[</span><span style="color: #5a7273;">'IBB-A'</span><span style="color: #5a7273;">]</span><span style="color: #bf6c68;">)</span>, <span style="color: #cb8986;">2</span><span style="color: #5e7e9b;">)</span>

<span style="color: #7e97af;">new_stats</span> = <span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'1B'</span>, <span style="color: #5a7273;">'SLG'</span>, <span style="color: #5a7273;">'OBS'</span>, <span style="color: #5a7273;">'OPS'</span>, <span style="color: #5a7273;">'WHIP'</span>, <span style="color: #5a7273;">'KperBB'</span><span style="color: #5e7e9b;">]</span>
<span style="color: #5e7e9b; font-weight: bold;">for</span> col <span style="color: #5e7e9b; font-weight: bold;">in</span> new_stats:
    <span style="color: #7e97af;">df</span><span style="color: #5e7e9b;">[</span>col<span style="color: #5e7e9b;">]</span> = df<span style="color: #5e7e9b;">[</span>col<span style="color: #5e7e9b;">]</span>.fillna<span style="color: #5e7e9b;">(</span><span style="color: #cb8986;">0</span><span style="color: #5e7e9b;">)</span>
    <span style="color: #7e97af;">df</span><span style="color: #5e7e9b;">[</span>col<span style="color: #5e7e9b;">]</span> = df<span style="color: #5e7e9b;">[</span>col<span style="color: #5e7e9b;">]</span>.astype<span style="color: #5e7e9b;">(</span><span style="color: #5a7273;">'float32'</span><span style="color: #5e7e9b;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6feaf58" class="outline-2">
<h2 id="org6feaf58"><span class="section-number-2">7</span> Fulfilling criteria for HoF eligibility</h2>
<div class="outline-text-2" id="text-7">
<p>
Removing players who have played less than 10 years as these players are not
eligible for the MLB Hall of Fame.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #7e97af;">df</span> = df<span style="color: #5e7e9b;">[</span>df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'Years_Played'</span><span style="color: #bf6c68;">]</span> &gt;= <span style="color: #cb8986;">10</span><span style="color: #5e7e9b;">]</span> <span style="color: #48485e;"># </span><span style="color: #48485e;">10 years</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5827419" class="outline-2">
<h2 id="org5827419"><span class="section-number-2">8</span> Preparing to Feed Data into Model</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org22b3807" class="outline-3">
<h3 id="org22b3807"><span class="section-number-3">8.1</span> Selecting Variables to use in training</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7e97af;">hof_label_df</span> = df<span style="color: #5e7e9b;">[</span><span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'playerID'</span>, <span style="color: #5a7273;">'HoF'</span>, <span style="color: #5a7273;">'POS'</span><span style="color: #bf6c68;">]</span><span style="color: #5e7e9b;">]</span>
<span style="color: #7e97af;">df_inf_containing</span> = df<span style="color: #5e7e9b;">[</span><span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'WHIP'</span>, <span style="color: #5a7273;">'KperBB'</span><span style="color: #bf6c68;">]</span><span style="color: #5e7e9b;">]</span>
<span style="color: #7e97af;">df</span> = df<span style="color: #5e7e9b;">[</span><span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'G_all'</span>, <span style="color: #5a7273;">'finalGame'</span>, <span style="color: #5a7273;">'OPS'</span>, <span style="color: #5a7273;">'SB'</span>, <span style="color: #5a7273;">'HR'</span>,
         <span style="color: #5a7273;">'Years_Played'</span>, <span style="color: #5a7273;">'Most Valuable Player'</span>, <span style="color: #5a7273;">'AS_games'</span>,
         <span style="color: #5a7273;">'Gold Glove'</span>, <span style="color: #5a7273;">'Rookie of the Year'</span>, <span style="color: #5a7273;">'World Series MVP'</span>, <span style="color: #5a7273;">'Silver Slugger'</span>,
         <span style="color: #5a7273;">'WHIP'</span>, <span style="color: #5a7273;">'ERA'</span>, <span style="color: #5a7273;">'KperBB'</span>, <span style="color: #5a7273;">'PO'</span>, <span style="color: #5a7273;">'A'</span>, <span style="color: #5a7273;">'E'</span>, <span style="color: #5a7273;">'DP'</span><span style="color: #bf6c68;">]</span><span style="color: #5e7e9b;">]</span>

<span style="color: #7e97af;">df_inf</span> = np.isinf<span style="color: #5e7e9b;">(</span>df_inf_containing<span style="color: #5e7e9b;">)</span>
<span style="color: #48485e;"># </span><span style="color: #48485e;">Removing index of values with infinity values from both data to be</span>
<span style="color: #48485e;"># </span><span style="color: #48485e;">standardized and the label data</span>
<span style="color: #7e97af;">df</span> = df<span style="color: #5e7e9b;">[</span>~df_inf<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'WHIP'</span><span style="color: #bf6c68;">]</span><span style="color: #5e7e9b;">]</span>
<span style="color: #7e97af;">df</span> = df<span style="color: #5e7e9b;">[</span>~df_inf<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'KperBB'</span><span style="color: #bf6c68;">]</span><span style="color: #5e7e9b;">]</span>
<span style="color: #7e97af;">hof_label_df</span> = hof_label_df<span style="color: #5e7e9b;">[</span>~df_inf<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'WHIP'</span><span style="color: #bf6c68;">]</span><span style="color: #5e7e9b;">]</span>
<span style="color: #7e97af;">hof_label_df</span> = hof_label_df<span style="color: #5e7e9b;">[</span>~df_inf<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'KperBB'</span><span style="color: #bf6c68;">]</span><span style="color: #5e7e9b;">]</span>
</pre>
</div>

<pre class="example">
/tmp/babel-aDvIBM/python-PmDC6f:12: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df = df[~df_inf['KperBB']]
/tmp/babel-aDvIBM/python-PmDC6f:14: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  hof_label_df = hof_label_df[~df_inf['KperBB']]
</pre>
</div>
</div>
