src/filter_data.org
** One Hot Encoding for Player Position Data

#+begin_src python :session SESSION_1 :results output :exports both
  # creating one hot encoder object 
  onehotencoder = OneHotEncoder()
  #reshape the 1-D country array to 2-D as fit_transform expects 2-D and finally fit the object 
  X = onehotencoder.fit_transform(hof_label_df[['POS']]).toarray()
  #To add this back into the original dataframe 
  dfOneHot = pd.DataFrame(X, columns = ["POS_"+str(int(i)) for i in range(X.shape[1])]) 
#+end_src

 #+RESULTS:

** Standardizing the Data

#+begin_src python :session SESSION_1 :results output :exports both
  df = pd.DataFrame(StandardScaler().fit_transform(df), columns=df.columns)
  # Joining the one hot encoded dummy variables to standardized data set
  df = df.join(dfOneHot)
  # Adding back the HoF data
  df.insert(df.shape[1], 'HoF', hof_label_df['HoF'].to_numpy())
#+end_src

 #+RESULTS:

** Converting HoF back to strings

#+begin_src python :session SESSION_1 :results output :exports both
 df['HoF'] = df['HoF'].replace(1.0, 'Y', regex=True)
 df['HoF'] = df['HoF'].replace(np.nan, 'N', regex=True)
 df['HoF'] = df['HoF'].replace(0.0, 'N', regex=True)
#+end_src

 #+RESULTS:

** Splitting dataset by HoF players

 #+begin_src python :session SESSION_1 :results output :exports both
reg_df = df[df['HoF'] == 'N']
hof_df = df[df['HoF'] == 'Y']
 #+end_src

 #+RESULTS:

** Under-sampling the non-HoF players

   Currently, the non-HoF players are not undersampled.

 #+begin_src python :session SESSION_1 :results output :exports both
reg_seeded_random = RandomState(1)
# sampled_reg_df = reg_df.sample(n = num_sample(DATA_BALANCE_PERCENTAGE, hof_df), random_state=reg_seeded_random)
sampled_reg_df = reg_df
 #+end_src

 #+RESULTS:

** Splitting reg and HoF into train and test

 #+begin_src python :session SESSION_1 :results output :exports both
sep_seeded_random = RandomState(1)
train_reg_df = sampled_reg_df.sample(frac=TRAINING_DATA_FRACTION, random_state=sep_seeded_random)
test_reg_df = sampled_reg_df.drop(train_reg_df.index)
train_hof_df = hof_df.sample(frac=TRAINING_DATA_FRACTION, random_state=sep_seeded_random)
test_hof_df = hof_df.drop(train_hof_df.index)

print('length of train_reg_df: ', len(train_reg_df))
print('length of test_reg_df: ', len(test_reg_df))
print('length of train_hof_df: ', len(train_hof_df))
print('length of test_hof_df: ', len(test_hof_df))
 #+end_src

 #+RESULTS:
 : length of train_reg_df:  2537
 : length of test_reg_df:  634
 : length of train_hof_df:  180
 : length of test_hof_df:  45

** Merging the test and training datasets

 #+begin_src python :session SESSION_1 :results output :exports both
train_df = pd.concat([train_hof_df, train_reg_df])
test_df = pd.concat([test_hof_df, test_reg_df])
# Shuffling the data
train_df = train_df.sample(frac = 1, random_state=sep_seeded_random)
test_df = test_df.sample(frac = 1, random_state=sep_seeded_random)
 #+end_src

 #+RESULTS:

* Save the different testing and validation data sets

 #+begin_src python :session SESSION_1 :results output :exports both
train_df.to_csv('../data/train_data_' + NAME + '.csv', index=False)
test_df.to_csv('../data/test_data_' + NAME + '.csv', index=False)
 #+end_src

 #+RESULTS:

