src/filter_data.html

<div id="outline-container-org7237659" class="outline-3">
<h3 id="org7237659"><span class="section-number-3">8.2</span> One Hot Encoding for Player Position Data</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #48485e;"># </span><span style="color: #48485e;">creating one hot encoder object </span>
<span style="color: #7e97af;">onehotencoder</span> = OneHotEncoder<span style="color: #5e7e9b;">()</span>
<span style="color: #48485e;">#</span><span style="color: #48485e;">reshape the 1-D country array to 2-D as fit_transform expects 2-D and finally fit the object </span>
<span style="color: #7e97af;">X</span> = onehotencoder.fit_transform<span style="color: #5e7e9b;">(</span>hof_label_df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">[</span><span style="color: #5a7273;">'POS'</span><span style="color: #5a7273;">]</span><span style="color: #bf6c68;">]</span><span style="color: #5e7e9b;">)</span>.toarray<span style="color: #5e7e9b;">()</span>
<span style="color: #48485e;">#</span><span style="color: #48485e;">To add this back into the original dataframe </span>
<span style="color: #7e97af;">dfOneHot</span> = pd.DataFrame<span style="color: #5e7e9b;">(</span>X, columns = <span style="color: #bf6c68;">[</span><span style="color: #5a7273;">"POS_"</span>+<span style="color: #5e7e9b;">str</span><span style="color: #5a7273;">(</span><span style="color: #5e7e9b;">int</span><span style="color: #aabf7f;">(</span>i<span style="color: #aabf7f;">)</span><span style="color: #5a7273;">)</span> <span style="color: #5e7e9b; font-weight: bold;">for</span> i <span style="color: #5e7e9b; font-weight: bold;">in</span> <span style="color: #5e7e9b;">range</span><span style="color: #5a7273;">(</span>X.shape<span style="color: #aabf7f;">[</span><span style="color: #cb8986;">1</span><span style="color: #aabf7f;">]</span><span style="color: #5a7273;">)</span><span style="color: #bf6c68;">]</span><span style="color: #5e7e9b;">)</span> 
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb7a7589" class="outline-3">
<h3 id="orgb7a7589"><span class="section-number-3">8.3</span> Standardizing the Data</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7e97af;">df</span> = pd.DataFrame<span style="color: #5e7e9b;">(</span>StandardScaler<span style="color: #bf6c68;">()</span>.fit_transform<span style="color: #bf6c68;">(</span>df<span style="color: #bf6c68;">)</span>, columns=df.columns<span style="color: #5e7e9b;">)</span>
<span style="color: #48485e;"># </span><span style="color: #48485e;">Joining the one hot encoded dummy variables to standardized data set</span>
<span style="color: #7e97af;">df</span> = df.join<span style="color: #5e7e9b;">(</span>dfOneHot<span style="color: #5e7e9b;">)</span>
<span style="color: #48485e;"># </span><span style="color: #48485e;">Adding back the HoF data</span>
df.insert<span style="color: #5e7e9b;">(</span>df.shape<span style="color: #bf6c68;">[</span><span style="color: #cb8986;">1</span><span style="color: #bf6c68;">]</span>, <span style="color: #5a7273;">'HoF'</span>, hof_label_df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'HoF'</span><span style="color: #bf6c68;">]</span>.to_numpy<span style="color: #bf6c68;">()</span><span style="color: #5e7e9b;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org609d56e" class="outline-3">
<h3 id="org609d56e"><span class="section-number-3">8.4</span> Converting HoF back to strings</h3>
<div class="outline-text-3" id="text-8-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7e97af;">df</span><span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'HoF'</span><span style="color: #5e7e9b;">]</span> = df<span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'HoF'</span><span style="color: #5e7e9b;">]</span>.replace<span style="color: #5e7e9b;">(</span><span style="color: #cb8986;">1</span>.<span style="color: #cb8986;">0</span>, <span style="color: #5a7273;">'Y'</span>, regex=<span style="color: #cb8986;">True</span><span style="color: #5e7e9b;">)</span>
<span style="color: #7e97af;">df</span><span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'HoF'</span><span style="color: #5e7e9b;">]</span> = df<span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'HoF'</span><span style="color: #5e7e9b;">]</span>.replace<span style="color: #5e7e9b;">(</span>np.nan, <span style="color: #5a7273;">'N'</span>, regex=<span style="color: #cb8986;">True</span><span style="color: #5e7e9b;">)</span>
<span style="color: #7e97af;">df</span><span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'HoF'</span><span style="color: #5e7e9b;">]</span> = df<span style="color: #5e7e9b;">[</span><span style="color: #5a7273;">'HoF'</span><span style="color: #5e7e9b;">]</span>.replace<span style="color: #5e7e9b;">(</span><span style="color: #cb8986;">0</span>.<span style="color: #cb8986;">0</span>, <span style="color: #5a7273;">'N'</span>, regex=<span style="color: #cb8986;">True</span><span style="color: #5e7e9b;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4514ba5" class="outline-3">
<h3 id="org4514ba5"><span class="section-number-3">8.5</span> Splitting dataset by HoF players</h3>
<div class="outline-text-3" id="text-8-5">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7e97af;">reg_df</span> = df<span style="color: #5e7e9b;">[</span>df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'HoF'</span><span style="color: #bf6c68;">]</span> == <span style="color: #5a7273;">'N'</span><span style="color: #5e7e9b;">]</span>
<span style="color: #7e97af;">hof_df</span> = df<span style="color: #5e7e9b;">[</span>df<span style="color: #bf6c68;">[</span><span style="color: #5a7273;">'HoF'</span><span style="color: #bf6c68;">]</span> == <span style="color: #5a7273;">'Y'</span><span style="color: #5e7e9b;">]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd71f4b9" class="outline-3">
<h3 id="orgd71f4b9"><span class="section-number-3">8.6</span> Under-sampling the non-HoF players</h3>
<div class="outline-text-3" id="text-8-6">
<p>
Currently, the non-HoF players are not undersampled.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #7e97af;">reg_seeded_random</span> = RandomState<span style="color: #5e7e9b;">(</span><span style="color: #cb8986;">1</span><span style="color: #5e7e9b;">)</span>
<span style="color: #48485e;"># </span><span style="color: #48485e;">sampled_reg_df = reg_df.sample(n = num_sample(DATA_BALANCE_PERCENTAGE, hof_df), random_state=reg_seeded_random)</span>
<span style="color: #7e97af;">sampled_reg_df</span> = reg_df
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd7b3308" class="outline-3">
<h3 id="orgd7b3308"><span class="section-number-3">8.7</span> Splitting reg and HoF into train and test</h3>
<div class="outline-text-3" id="text-8-7">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7e97af;">sep_seeded_random</span> = RandomState<span style="color: #5e7e9b;">(</span><span style="color: #cb8986;">1</span><span style="color: #5e7e9b;">)</span>
<span style="color: #7e97af;">train_reg_df</span> = sampled_reg_df.sample<span style="color: #5e7e9b;">(</span>frac=TRAINING_DATA_FRACTION, random_state=sep_seeded_random<span style="color: #5e7e9b;">)</span>
<span style="color: #7e97af;">test_reg_df</span> = sampled_reg_df.drop<span style="color: #5e7e9b;">(</span>train_reg_df.index<span style="color: #5e7e9b;">)</span>
<span style="color: #7e97af;">train_hof_df</span> = hof_df.sample<span style="color: #5e7e9b;">(</span>frac=TRAINING_DATA_FRACTION, random_state=sep_seeded_random<span style="color: #5e7e9b;">)</span>
<span style="color: #7e97af;">test_hof_df</span> = hof_df.drop<span style="color: #5e7e9b;">(</span>train_hof_df.index<span style="color: #5e7e9b;">)</span>

<span style="color: #5e7e9b; font-weight: bold;">print</span><span style="color: #5e7e9b;">(</span><span style="color: #5a7273;">'length of train_reg_df: '</span>, <span style="color: #5e7e9b;">len</span><span style="color: #bf6c68;">(</span>train_reg_df<span style="color: #bf6c68;">)</span><span style="color: #5e7e9b;">)</span>
<span style="color: #5e7e9b; font-weight: bold;">print</span><span style="color: #5e7e9b;">(</span><span style="color: #5a7273;">'length of test_reg_df: '</span>, <span style="color: #5e7e9b;">len</span><span style="color: #bf6c68;">(</span>test_reg_df<span style="color: #bf6c68;">)</span><span style="color: #5e7e9b;">)</span>
<span style="color: #5e7e9b; font-weight: bold;">print</span><span style="color: #5e7e9b;">(</span><span style="color: #5a7273;">'length of train_hof_df: '</span>, <span style="color: #5e7e9b;">len</span><span style="color: #bf6c68;">(</span>train_hof_df<span style="color: #bf6c68;">)</span><span style="color: #5e7e9b;">)</span>
<span style="color: #5e7e9b; font-weight: bold;">print</span><span style="color: #5e7e9b;">(</span><span style="color: #5a7273;">'length of test_hof_df: '</span>, <span style="color: #5e7e9b;">len</span><span style="color: #bf6c68;">(</span>test_hof_df<span style="color: #bf6c68;">)</span><span style="color: #5e7e9b;">)</span>
</pre>
</div>

<pre class="example">
length of train_reg_df:  2537
length of test_reg_df:  634
length of train_hof_df:  180
length of test_hof_df:  45
</pre>
</div>
</div>

<div id="outline-container-org7e18cbc" class="outline-3">
<h3 id="org7e18cbc"><span class="section-number-3">8.8</span> Merging the test and training datasets</h3>
<div class="outline-text-3" id="text-8-8">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7e97af;">train_df</span> = pd.concat<span style="color: #5e7e9b;">(</span><span style="color: #bf6c68;">[</span>train_hof_df, train_reg_df<span style="color: #bf6c68;">]</span><span style="color: #5e7e9b;">)</span>
<span style="color: #7e97af;">test_df</span> = pd.concat<span style="color: #5e7e9b;">(</span><span style="color: #bf6c68;">[</span>test_hof_df, test_reg_df<span style="color: #bf6c68;">]</span><span style="color: #5e7e9b;">)</span>
<span style="color: #48485e;"># </span><span style="color: #48485e;">Shuffling the data</span>
<span style="color: #7e97af;">train_df</span> = train_df.sample<span style="color: #5e7e9b;">(</span>frac = <span style="color: #cb8986;">1</span>, random_state=sep_seeded_random<span style="color: #5e7e9b;">)</span>
<span style="color: #7e97af;">test_df</span> = test_df.sample<span style="color: #5e7e9b;">(</span>frac = <span style="color: #cb8986;">1</span>, random_state=sep_seeded_random<span style="color: #5e7e9b;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf51f0bf" class="outline-2">
<h2 id="orgf51f0bf"><span class="section-number-2">9</span> Save the different testing and validation data sets</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-python">train_df.to_csv<span style="color: #5e7e9b;">(</span><span style="color: #5a7273;">'../data/train_data_'</span> + NAME + <span style="color: #5a7273;">'.csv'</span>, index=<span style="color: #cb8986;">False</span><span style="color: #5e7e9b;">)</span>
test_df.to_csv<span style="color: #5e7e9b;">(</span><span style="color: #5a7273;">'../data/test_data_'</span> + NAME + <span style="color: #5a7273;">'.csv'</span>, index=<span style="color: #cb8986;">False</span><span style="color: #5e7e9b;">)</span>
</pre>
</div>
</div>
</div>
